{"keras_version": "2.2.2", "config": [{"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "kernel_constraint": null, "name": "conv2d_1", "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "filters": 50, "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 10, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}